tap "hashicorp/tap"
tap "mostlygeek/llama-swap"
# Cross-platform make
brew "cmake"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# LLM inference in C/C++
brew "llama.cpp"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Vault
brew "hashicorp/tap/vault"
# Proxy server for swapping models on llama.cpp
brew "mostlygeek/llama-swap/llama-swap"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
vscode "esbenp.prettier-vscode"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscodevim.vim"
uv "-"
uv "-"
uv "mistral-vibe"
uv "mlx-lm"
uv "platon-cli"
